<template>
  <div class="about">
    <h6>从1994年开始培养计算机人才，1999年成立计算机系,2000年西南工学院与绵阳经济技术高等专科学校合并组建成立西南科技大学后更名为计算机科学与技术学院。学院现有计算机科学与技术、软件工程2个一级学科硕士学位授权点，拥有电子信息专业硕士学位点（计算机技术领域），拥有计算机系统结构、计算机应用技术、信息安全、可视化与人机交互、领域软件工程、软件服务工程6个二级学科，拥有国防特色学科方向1个。现有软件工程、计算机科学与技术、信息安全、医学影像技术4个本科专业，其中软件工程专业为国家一流本科专业建设点、“国家卓越工程师教育培养计划”专业、四川省特色专业，计算机科学与技术专业为国家一流本科专业建设点、“四川省卓越工程师教育培养计划”专业、四川省特色专业、学校“8111品牌”专业，信息安全专业入选2021年四川省一流本科专业建设点。

      学院拥有一支学历高、经验丰富的师资队伍。现有教职工128人，其中专任教师105人,具有高级职称教师45人，其中正高职称10人，副高职称35人，有博士39人，5名教师获得海外学位，19名教师有一年以上海外学习工作经历。四川省“千人计划”1人，四川省“突贡”专家2人，四川省学术与技术带头人1人，四川省学术与技术带头人后备人选4人，绵阳市“4+3"高端成长型战略新兴产业领军人才3人。二级教授1人，硕士生导师78人(含院外)。有中国计算机学会会员的教师117人。另外，学院从董事单位聘任科研水平高、实践经验丰富的兼职教师58人。

      学院建立良好的教学科研环境，配备先进的教学实验设备。实验室面积8000余平方米，教学科研设备总值4300余万元（其中研究设备2400余万元）。学院现设计算机工程系、软件工程系两个教学系和一个实验教学中心，四川省属高校首批省级特色化示范性软件学院，拥有特种能源及新能源材料科学数据库四川省科技资源共享服务平台、四川省大数据与智能系统工程技术研究中心、四川省互联网健康服务融合工程实验室、四川省智能电器与智能系统高校重点实验室、四川省计算机应用实验教学示范中心、、四川省工业软件虚拟仿真实验教学中心、高分辨率对地观测系统四川数据与应用中心绵阳分中心、绵阳市智能医疗系统工程实验室、绵阳市网络融合工程实验室、绵阳市网络空间安全实验室、计算机应用研究所等教学科研平台。在学校内还共享国家大学科技园、四川省军民融合研究院等平台。

      学院教师在计算机软件、嵌入式技术、信息安全、数据科学与工程、科学与计算工程、计算机视觉、人机交互与可视化、医学影像技术、智能医学与智能医疗仪器、人工智能与深度学习等方面有较强研究能力，相关研究成果广泛应用在政府、军队、国防科技工业和区域经济建设的众多行业。学院近五年承担科研项目189项，其中国家863计划、科技支撑计划、国家自然科学基金等12项，到校纵横向科研经费3855余万元；发表学术论文330余篇，其中SCI、EI、ISTP收录150余篇，出版专著及教材4部，获省部级科技奖6项，授权专利及软件著作权58项。

      学院现有在校本科学生2634人，硕士研究生305人（非全日制35人），留学生45人（其中博士4人，硕士5人，本科36人）。学院以培养学生工程实践能力、技术创新能力和综合素质为中心，深化教学改革，形成了“基础扎实、能力突出”的人才培养特色。近五年承担教改项目90余项，其中省级教改项目30余项，获得省级教学成果奖2项。建有省级精品课程（共享课程、示范课程）6门，校级精品课程20余门。学生参与各类竞赛获得省部级以上奖项共计676人次。12名同学被评为“全国计算机学会（CCF）百名优秀大学生”。

      毕业生主要分布在川、渝、粤、浙、苏、沪、京等国家、省级软件和信息服务业基地企业、政府部门和事业单位。近3年，137名毕业生被阿里巴巴网络有限公司、百度在线网络技术有限公司、腾讯科技有限公司、深信服科技有限公司等国内外知名企业录用。一些优秀本科生考入（保送）清华大学、浙江大学、中国科学与技术大学、英国曼彻斯特大学、纽卡斯尔大学、澳大利亚墨尔本大学、伦敦大学、悉尼大学等国内外知名大学攻读硕士研究生。

      中国高等教育管理专业评估机构（MYCOS）对我院2011-2014届本科毕业生的4次调查显示，学生的就业满意度比同类高校高16%，就业竞争力达98.8%，就业竞争力和平均月收入均居全省前茅。在2022年中国校友网本科专业排名中软件工程和医学影像技术专业进入全国前10%，计算机科学与技术专业进入全国前20%。

      进入新时代，学院以“双一流”建设为契机，在学校“共建与区域产学研联合办学”体制下，积极与区域国防军工单位、科研院所、企业开展科研合作、资源共享和人才培养，将学院建设为特色鲜明的教学研究型学院，为实现学院愿景“成为全国地方高校在计算机人才培养、学科建设等方面的引领者”而努力奋斗！</h6>
    <img src="src/assets/computer.png" width="900" height="600"  alt="" id="computer"/>
  </div>

  <div id="bar" style="width: 500px;height: 600px"></div>


<!--  <ph-progress-bar-->
<!--      :value="0"-->
<!--      :max="100"-->
<!--      format="当前进度：v/m"-->
<!--  ></ph-progress-bar>-->
<!--  <p> demo1 </p>-->
<!--  <ph-progress-bar-->
<!--      :value="10"-->
<!--      :max="100"-->
<!--      format="进度：%"-->
<!--  ></ph-progress-bar>-->

</template>

<style>
@media (min-width: 1024px) {
  .about {
    min-height: 100vh;
    display: flex;
    align-items: center;
    color: #181815;
  }
}
</style>
<style type="text/css">
#computer{
  position:absolute;
  left:600px;
  top:50px;
}
</style>
<script setup lang="ts">
import SectorBenke from "@/components/SectorBenke.vue";
import PhProgressBar from 'ph-progress-bar'
</script>